app/controllers/admin_controller.rb

	def login
    if request.post?
      user = User.authenticate(params[:name], params[:password])
      if user
        session[:user_id] = user.id
				puts session[:user_id]
				puts "*******************************************"
				@current_user = User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def index
		puts "*******************************************"
		@current_user =  User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1