app/controllers/home_controller.rb

  def index
		@current_user = User.find_by_id(session[:user_id])
		@posts = Post.paginate :page => params[:page], :order => "created_at DESC"
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "posts".* FROM "posts"