app/controllers/posts_controller.rb

  def index
		@current_user = User.find_by_id(session[:user_id])
		if @current_user
	    @posts = Post.all
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "posts".* FROM "posts"

  def show
		@current_user = User.find_by_id(session[:user_id])
		if @current_user != nil
			@post = Post.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def new
    @post = Post.new
		@current_user = User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @post = Post.find_by_id(params[:id])
		@current_user = User.find_by_id(session[:user_id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ('Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vestibulum sed libero a nulla sagittis rutrum nec at mauris. Ut quis neque quis nisl dignissim consectetur. Curabitur sed elit ut dolor sagittis mattis at eget ipsum. Nunc scelerisque nibh vitae risus venenatis bibendum. Vivamus sagittis risus at metus scelerisque ut molestie dolor suscipit. Aliquam nec felis vitae dui aliquet eleifend. Pellentesque auctor, dui et laoreet interdum, orci magna venenatis sem, vitae varius dolor ipsum fermentum lectus. Donec porttitor magna ut elit dapibus ultrices. Vestibulum congue ornare ipsum, nec scelerisque enim rutrum viverra. Curabitur viverra lectus quis est iaculis eget tincidunt lectus venenatis. Cras sed mauris ac nulla ultrices scelerisque. Ut condimentum porttitor fermentum. In at libero sed diam pulvinar euismod quis id eros. Sed faucibus suscipit libero sed malesuada. Vivamus vel nibh nec est convallis rhoncus.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
UPDATE "posts" SET "content" = 'alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf alsdkjflkasjdflaskdjffffffff laskdjfa lskdjf lsdfj laskdjf alskdjf alskdjf alskdjf lskdjf alskdjf alskdjf alskdjf ', "updated_at" = '2011-01-04 17:24:02.316809' WHERE ("posts"."id" = 2)